# GrayLayer

## Description
Procedure GrayLayer sets the visibility status of the active layer to grayed. Objects on grayed layers will always appear grayed when viewed from other layers.&lt;BR&gt;
&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE GrayLayer;
```

```python

def vs.GrayLayer():
    return None
```

## Examples
```pascal
Layer('Future Construction');

GrayLayer;

{grays the layer 'Future Construction'}

```

## Version
Availability: from MiniCAD
## Category
* Layers